---
kind: property
id: P:Autodesk.Revit.DB.CylindricalSurface.Origin
zh: 原点
source: html/fb029049-10fb-0e2c-5216-813ff9b3e6b3.htm
---
# Autodesk.Revit.DB.CylindricalSurface.Origin Property

**中文**: 原点

Center of the circle that defines the base of the cylinder. This is the origin of the local coordinate system associated with this cylinder.

## Syntax (C#)
```csharp
public XYZ Origin { get; }
```